from django.core.management.base import BaseCommand
from travel_api.models import TourDayOption

options = [
    {
        "name": "Виїзд",
        "name_ru": "Выезд"
    },
    {
        "name": "Сніданок",
        "name_ru": "Завтрак"
    },
    {
        "name": "Заселення",
        "name_ru": "Заселение"
    },
    {
        "name": "Озеро Бренскули",
        "name_ru": "Озеро Бренскули"
    },
    {
        "name": "Чаювання біля озера",
        "name_ru": "Чаепитие у озера"
    },
    {
        "name": "Вечеря + кальян",
        "name_ru": "Ужин + кальян"
    },
    {
        "name": "Чан або баня",
        "name_ru": "Чан или баня"
    },
    {
        "name": "Виїзд на вершину близниця",
        "name_ru": "Выезд на вершину Близница"
    },
    {
        "name": "Склфі на фоні красивих краєвидів",
        "name_ru": "Селфи на фоне красивых пейзажей"
    },
    {
        "name": "Водоспад Піп Іван",
        "name_ru": "Водопад Пип Иван"
    },
    {
        "name": "Вечеря на вогнищі",
        "name_ru": "Ужин у костра"
    },
    {
        "name": "Виселення",
        "name_ru": "Выселение"
    },
    {
        "name": "Біосферний заповідник",
        "name_ru": "Биосферный заповедник"
    },
    {
        "name": "Сироварня \"Розенталь\"",
        "name_ru": "Сыроварня \"Розенталь\""
    },
    {
        "name": "Прощання з Карпатами",
        "name_ru": "Прощание с Карпатами"
    },
    {
        "name": "Дорога додому",
        "name_ru": "Дорога домой"
    },
    {
        "name": "Прогулянка Карпатами",
        "name_ru": "Прогулка по Карпатам"
    },
    {
        "name": "Сироварня+дегустація",
        "name_ru": "Сыроварня+дегустация"
    },
    {
        "name": "Квадроцикли",
        "name_ru": "Квадроциклы"
    },
    {
        "name": "Баня/чани",
        "name_ru": "Баня/чаны"
    },
    {
        "name": "Виїзд на масив Свидовець (гори Жандарм(драгобрат)",
        "name_ru": "Выезд на массив Свидовец (горы Жандарм(Драгобрат)"
    },
    {
        "name": "Пікнік з вершинами",
        "name_ru": "Пикник на вершинах"
    },
    {
        "name": "Спуск в село Кваси",
        "name_ru": "Спуск в село Квасы"
    },
    {
        "name": "Виїзд до озера Апшпинець",
        "name_ru": "Выезд к озеру Апшпинец"
    },
    {
        "name": "Чаювання з неймовірним краєвидом",
        "name_ru": "Чаепитие с невероятным пейзажем"
    },
    {
        "name": "Труфанецький водоспад",
        "name_ru": "Труфанецкий водопад"
    },
    {
        "name": "Оленяча ферма у селі Іза",
        "name_ru": "Оленья ферма в селе Иза"
    },
    {
        "name": "Термальні води село Велятино \"теплі води\"",
        "name_ru": "Термальные воды село Велятино \"теплые воды\""
    },
    {
        "name": "Трансфер до озера Синевир",
        "name_ru": "Трансфер к озеру Синевир"
    },
    {
        "name": "Дегуствція сиру на \"селиській сироварні\" або дегустація м'ясних виробів на еко-фермі \"зелений гай\"",
        "name_ru": "Дегустация сыра на \"сельской сыроварне\" или дегустация мясных изделий на экологической ферме \"зеленая роща\""
    },
    {
        "name": "Прогулянка Закарпаттям",
        "name_ru": "Прогулка по Закарпатью"
    },
    {
        "name": "Хустський замок",
        "name_ru": "Хустский замок"
    },
    {
        "name": "Обід",
        "name_ru": "Обед"
    },
    {
        "name": "Хата-музей кінофільму \"тіні забутих предків\"",
        "name_ru": "Дом-музей кинофильма \"Тени забытых предков\""
    },
    {
        "name": "Музей гуцульської магії",
        "name_ru": "Музей гуцульской магии"
    },
    {
        "name": "BBQ вечеря",
        "name_ru": "BBQ ужин"
    },
    {
        "name": "Настільні ігри",
        "name_ru": "Настольные игры"
    },
    {
        "name": "Виїзд до сироварні \" полонина кринта\"",
        "name_ru": "Выезд к сыроварне \"Полонина Кринта\""
    },
    {
        "name": "Писаний камінь",
        "name_ru": "Писаный камень"
    },
    {
        "name": "Виїзд на річку Чорний черемош (влітку, весною, можливий сплав річкою (рафтинг)",
        "name_ru": "Выезд на реку Черный Черемош (летом, весной, возможен сплав по реке (рафтинг)"
    },
    {
        "name": "Пивоварня \"верховина\"",
        "name_ru": "Пивоварня \"Верховина\""
    },
    {
        "name": "Жинецький водоспад",
        "name_ru": "Жинецкий водопад"
    },
    {
        "name": "Пепевернутий будиночок",
        "name_ru": "Перевернутый домик"
    },
    {
        "name": "Обід в колибі",
        "name_ru": "Обед в колыбе"
    },
    {
        "name": "Ловля форелі",
        "name_ru": "Ловля форели"
    },
    {
        "name": "Трансфер до г. Хом'як",
        "name_ru": "Трансфер к г. Хомяк"
    },
    {
        "name": "Гуцул ленд",
        "name_ru": "Гуцул ленд"
    },
    {
        "name": "Оглядове колесо",
        "name_ru": "Обзорное колесо"
    },
    {
        "name": "Приватна броварня",
        "name_ru": "Частная пивоварня"
    },
    {
        "name": "Виїзд до о. Несамовите",
        "name_ru": "Выезд к о. Несамовите"
    },
    {
        "name": "Прутський водоспад",
        "name_ru": "Прутский водопад"
    },
    {
        "name": "Виїжджаємо підкорюв",
        "name_ru": "Выезжаем покорять"
    }
]


class Command(BaseCommand):
    help = 'Update name in TourDayOption according to '

    def add_arguments(self, parser):
        parser.add_argument('num_entries', type=int, help='Number of fake entries to generate')

    def handle(self, *args, **kwargs):
        num_entries = kwargs['num_entries']
        for i in options:
            TourDayOption.objects.create(
                name=i['name'],
                name_ru=i['name_ru'],
                description=None,
                description_ru=None,
                date_start="2024-01-01",
                date_end="2024-01-01",
                is_landmark=False,
                image_url=None
            )

        self.stdout.write(self.style.SUCCESS(f'Successfully updated {num_entries}'))
